88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
/*****************************************************************************! 
  @brief  read all preferences values
  @details remember: short names (max 15 char), otherwise not stored
  @return void
*****************************************************************************/
void readPreferences()
{
    preferences.begin(prefIDENT, true);
    //----- counters etc.
    //int bytes=preferences.getBytes("prefs", prefs, sizeof(prefs));
    //----- verbosity
    if(preferences.isKey("verbosity"))
      wData.verbosity = (verbosityType)preferences.getULong("verbosity", d_verbosity);
    else {  // set default    
      wData.verbosity = d_verbosity;
      preferences.putULong("verbosity", wData.verbosity);
    }  
    //----- Graph weight
    if(preferences.isKey("graphWeight"))
      wData.graphWeight = (graphWeightType)preferences.getULong("graphWeight", d_graphWeight);
    else {  // set default    
      wData.graphWeight = d_graphWeight;
      preferences.putULong("graphWeight", wData.graphWeight);
    }  
    //----- Measurement interval in seconds
    if(preferences.isKey("mIntervSec"))   // sleep time target in seconds, controls the measurement
      wData.targetMeasurementIntervalSec = preferences.getLong("mIntervSec", d_targetMeasurementIntervalSec);
    else {  // set default    
      wData.targetMeasurementIntervalSec = d_targetMeasurementIntervalSec;
      preferences.putLong("mIntervSec", wData.targetMeasurementIntervalSec);
    }  
    //----- alarmDistanceM: distance from anchor to increase alarm counter
    if(preferences.isKey("alarmDistanceM"))   // alarm distance in meters
      wData.alarmDistanceM = preferences.getFloat("alarmDistanceM", d_alarmDistanceM);
    else {  // set default    
      wData.alarmDistanceM = d_alarmDistanceM;
      preferences.putFloat("alarmDistanceM", wData.alarmDistanceM);
    }  
    //----- alarmThreshold: if alarm counter is bigger than this threshold: alarm
    if(preferences.isKey("alarmThreshold"))   // alarm threshold
      wData.alarmThreshold = preferences.getLong("alarmThreshold", d_alarmThreshold);
    else {  // set default    
      wData.alarmThreshold = d_alarmThreshold;
      preferences.putLong("alarmThreshold", wData.alarmThreshold);
    }

    //----- anchorBearingDeg: direction to anchor
    if(preferences.isKey("anchorBearingDeg"))   // anchorBearingDeg
      wData.anchorBearingDeg = preferences.getFloat("anchorBearingDeg", d_anchorBearingDeg);
    else {  // set default    
      wData.anchorBearingDeg = d_anchorBearingDeg;
      preferences.putFloat("anchorBearingDeg", wData.anchorBearingDeg);
    }

    //----- anchorDistanceM: distance to anchor
    if(preferences.isKey("anchorDistanceM"))   // anchorDistanceM
      wData.anchorDistanceM = preferences.getFloat("anchorDistanceM", d_anchorDistanceM);
    else {  // set default    
      wData.anchorDistanceM = d_anchorDistanceM;
      preferences.putFloat("anchorDistanceM", wData.anchorDistanceM);
    }

    //----- noGpsAlertThreshold: alert threshold to alert if no gps signal detected
    if(preferences.isKey("noGpsAlThrsh"))   // noGpsAlertThreshold
      wData.noGpsAlertThreshold = preferences.getULong("noGpsAlThrsh", d_noGpsAlertThreshold);
    else {  // set default    
      wData.noGpsAlertThreshold = d_noGpsAlertThreshold;
      preferences.putULong("noGpsAlThrsh", wData.noGpsAlertThreshold); 
    }

    //int bytes2= preferences.getBytes("teststring2", teststring2, 80); // test
    //preferences.remove("teststring1"); // remove single key
    //preferences.clear();  // clear the namespace completely
    preferences.end(); // close the namespace

    sprintf(outstring,"Read Preferences: verbosity: %ld graphWeight: %ld Meas.IntervalSec %ld alarmDistance %3.1f alarmThreshold %ld",
            wData.verbosity, wData.graphWeight, wData.targetMeasurementIntervalSec, wData.alarmDistanceM, wData.alarmThreshold);
    logOut(2,outstring); 
    sprintf(outstring,"Read Preferences: anchorBearingDeg: %3.1f anchorDistanceM: %3.1f noGpsAlertThreshold: %ld",
            wData.anchorBearingDeg, wData.anchorDistanceM, wData.noGpsAlertThreshold);
    logOut(2,outstring);         
}    

/*****************************************************************************! 
  @brief  write all preference values
  @details 
  @return void
*****************************************************************************/
void writePreferences()
{
    size_t ret1, ret11, ret12, ret13, ret2, ret3, ret4, ret5, ret6, ret7;

    ret1=preferences.begin(prefIDENT, false);
    if(!ret1){
      sprintf(outstring,"could open preferences for writing, ret: %d", ret1);
      logOut(2,outstring);
    }  
    
    // verbosity and graph weight
    ret11 =   preferences.putULong("verbosity", wData.verbosity);
    ret12 =   preferences.putULong("graphWeight", wData.graphWeight);

    // measurement interval in seconds
    ret13 =   preferences.putLong("mIntervSec", wData.targetMeasurementIntervalSec);

    //----- alarm distance and alarm threshold
    ret2 = preferences.putFloat("alarmDistanceM", wData.alarmDistanceM);
    ret3 = preferences.putLong("alarmThreshold", wData.alarmThreshold);

    //----- distance and bearing to anchor which are set initially
    ret4 = preferences.putFloat("anchorBearingDeg", wData.anchorBearingDeg);
    ret5 = preferences.putFloat("anchorDistanceM", wData.anchorDistanceM);

    //---- alert threshold for "no GPS" count
    ret6 =   preferences.putULong("noGpsAlThrsh", wData.noGpsAlertThreshold);

    //int bytes2= preferences.getBytes("teststring2", teststring2, 80); // test
    //preferences.remove("teststring1"); // remove single key
    //preferences.clear();  // clear the namespace completely
    preferences.end(); // close the namespace

    sprintf(outstring,"Wrote Preferences: verbosity: %ld graphWeight: %ld Meas.IntervalSec %ld alarmDistance %3.1f alarmThreshold %ld",
            wData.verbosity, wData.graphWeight, wData.targetMeasurementIntervalSec, wData.alarmDistanceM, wData.alarmThreshold);
    logOut(2,outstring); 
    sprintf(outstring,"Read Preferences: anchorBearingDeg: %3.1f anchorDistanceM: %3.1f noGpsAlertThreshold: %ld",
            wData.anchorBearingDeg, wData.anchorDistanceM, wData.noGpsAlertThreshold);
    logOut(2,outstring);       
    sprintf(outstring,"Wrote Preferences: ret values: %d %d %d %d %d %d %d %d %d\n", 
                ret1, ret11, ret12, ret13, ret2, ret3, ret4, ret5, ret6);
    logOut(2,outstring); 
}


