88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
/*****************************************************************************! 
  @brief  writeCounterPreferences()
  @details writes the counter related preference data
  @return void
*****************************************************************************/
/*
void writeCounterPreferences()
{
  int ret11, ret12, ret13;
  bool writing_counter_prefs = false;
  writing_counter_prefs = true;
  sprintf(outstring,"writeCounterPreferences: startCounter %ld dischgCnt %ld prevVoltage %f prevMicrovolt %ld\n", 
     startCounter, dischgCnt, prevVoltage, prevMicrovolt),
  logOut(2,outstring);
  // open preferences namespace in rw mode mode and write preferences infos.
  preferences.begin(prefIDENT, false);

  // counters and previous microvolts
  ret11 =   preferences.putULong("startCounter", startCounter);  
  ret12 =   preferences.putULong("dischargeCnt", dischgCnt);
  ret13 =   preferences.putULong("prevMicrovolt", prevMicrovolt);
  preferences.end(); // close the namespace
  sprintf(outstring,"Write Counter preferences startCounter: %ld %d dischgCnt: %ld %d prevMicrovolt: %ld %d\n", 
    startCounter, ret11, dischgCnt, ret12, prevMicrovolt, ret13);
  logOut(2,outstring);        
}
*/

// stuff for optimization of gps receiver 

size_t sendUBX(uint8_t* msg, uint8_t len) {
  size_t written = ss.write(msg, len);
  ss.flush();
  delay(50);   // GPS Zeit geben
  return(written);
}

void addChecksum(uint8_t* msg, uint8_t len) {
  uint8_t ckA = 0, ckB = 0;
  for (uint8_t i = 2; i < len - 2; i++) {
    ckA += msg[i];
    ckB += ckA;
  }
  msg[len - 2] = ckA;
  msg[len - 1] = ckB;
}

// set update rate to 1 Hz, to reduce power consumption, as we do not need more frequent updates for our application.
size_t setRate1Hz() {
  uint8_t msg[] = {
    0xB5,0x62,
    0x06,0x08,     // CFG-RATE
    0x06,0x00,
    0xE8,0x03,     // 1000 ms
    0x01,0x00,     // nav rate
    0x01,0x00,     // UTC
    0x00,0x00
  };
  addChecksum(msg, sizeof(msg));
  size_t written = sendUBX(msg, sizeof(msg));
  return written;
}

// ---------- UBX: PSM setzen ----------
void setPSM(uint32_t updateMs) {
  uint32_t onTime = 3000;

  uint8_t msg[52] = {
    0xB5,0x62, // 0 UBX message
    0x06,0x3B, // 2 Class 0x06 (CFG), ID 0x3B (PM2)
    0x2C,0x00, // 4 Length of payload: 0x002C (44) bytes 
    0x01,0x00, // 6 version and reserved
    0x00,0x00, // 8 reserved
    0x08,0x00,0x00,0x00,  // 10 flags: bit 3 (update RTC on wakeup) and bit 0 (enable PSM) set, rest 
    0,0,0,0,   // 14 updatePeriod - The time between navigation fixes
    0,0,0,0,   // 18 searchPeriod - How long the receiver searches for satellites if a fix is not found.
    0,0,0,0,   // 22 gridOffset 
    0,0,0,0,   // 26 onTime - on time after first successful fix
    0,0,0,0,   // 30 minAcqTime -minimum search time
    0,0,0,0,   // 34
    0,0,0,0,   // 38 
    0,0,0,0,   // 42
    0,0
  };

  // zusatz versuch 1: set flags
  uint32_t flags = 0x00003008; // zusätzlich zu RTC + EPH
  memcpy(&msg[10], &flags, 4);

  // zusatz versuch 2: set  searchPeriod if updateMs > 10s
  uint32_t searchPeriod = 30000;
  if(updateMs > 10000)        // und bei langen pausen search persiod zusätzlich setzen
    memcpy(&msg[18], &searchPeriod, 4);

  memcpy(&msg[14], &updateMs, 4);
  memcpy(&msg[26], &onTime, 4);
  memcpy(&msg[30], &onTime, 4); // actually minAquTime

  /*
  // calculate checksum
  uint8_t ckA=0, ckB=0;
  for (int i=2; i<50; i++) {
    ckA += msg[i];
    ckB += ckA;
  }
  msg[50] = ckA;
  msg[51] = ckB;

  ss.write(msg, sizeof(msg));
  ss.flush();
  delay(100); // give GPS some time to process the message
  */ 
  addChecksum(msg, sizeof(msg));
  size_t written = sendUBX(msg, sizeof(msg));
  sprintf(outstring,"setPSM: updateMs: %ld onTime: %ld bytes written: %d", updateMs, onTime, written);
  logOut(2, outstring);
}

size_t disableNMEA(uint8_t msg, uint8_t rate) {

  uint8_t l_ubx[16] = {
    0xB5,0x62,  // UBX message
    0x06,0x01,  // Class 0x06 (CFG), ID 0x01 (MSG)
    0x02,0x00,  // Lengh of payload: 0x0002 bytes
    0x08,0x00,  // payload
    0xF0,msg,   
    0x00,rate,
    0x00,0x00,
    0x00,0x00   // checksum a and b
  };

  /*
  uint8_t ckA=0, ckB=0;
  for (int i=2;i<14;i++) { ckA+=l_ubx[i]; ckB+=ckA; }
    l_ubx[14]=ckA; l_ubx[15]=ckB;
  //gps.write(l_ubx,16);
  written = ss.write(l_ubx,16);
  ss.flush();
  delay(50); // give GPS some time to process the message
  */
  addChecksum(l_ubx, sizeof(l_ubx));
  size_t written = sendUBX(l_ubx, sizeof(l_ubx));

  sprintf(outstring,"disableNMEA: msg: %d rate: %d bytes written: %d", msg, rate, written);
  logOut(2, outstring);
  return written;
}

// switch off all NMEA messages except GGA and RMC, to optimize GPS performance
void optimizeNMEA()
{
  sprintf(outstring,"Optimizing NMEA messages, only GGA and RMC will be kept, rest will be switched off");
  logOut(2, outstring);

  // nur diese behalten:
  disableNMEA(0x00, 1); // GGA
  disableNMEA(0x04, 1); // RMC

  // alles andere aus:
  disableNMEA(0x01, 0); // GLL
  disableNMEA(0x02, 0); // GSA
  disableNMEA(0x03, 0); // GSV
  disableNMEA(0x05, 0); // VTG
}

/*****************************************************************************! 
  @brief  setup routine
  @details 
  @return void
*****************************************************************************/
void setup()
{
  startTimeMillis = millis(); // remember time when woken up
  Serial.begin(115200);   // set speed for serial monitor

  logOut(2,(char*)"**********************************************************");
  sprintf(outstring,"* %s %s - %s ",PROGNAME, VERSION, BUILD_DATE);
  logOut(2,outstring);
  logOut(2,(char*)"**********************************************************");

  uint32_t size_wData = sizeof(wData);
  sprintf(outstring,"Size of wData: %d bytes. Remaining RTC Memory: %d bytes", size_wData, 4096-size_wData); 
  logOut(2,outstring);

  #ifdef READ_PREFERENCES
    // get data from EEPROM using preferences library in readonly mode
    sprintf(outstring," before readPreferences()");
    logOut(2,outstring);
    readPreferences();
  #endif

  // increment start counter
  wData.startCounter++;

   // initialize rotary encoder
   ESP32Encoder::useInternalWeakPullResistors = puType::up;
   encoder.attachHalfQuad(ENCODER_CLK_PIN, ENCODER_DT_PIN);
   encoder.setCount(0);

