88markus88/ESP32_Anchor_Alarm/src/ePaperAnchorAlarm.cpp
/*****************************************************************************! 
  @brief  handleParamChange - Main worker routine to handle single parameter changes
  @details This routine handles the adaptation of a single parameter via rotary encode
  @param  int trianglePos : position of triangle indicating which parameter to change. 
  @param  0: anchor bearing; 1: anchor distance, 2: alarm coount; 3:alarm distance
  @return boolean : true if parameter change ongoing, false if exit parameter change mode

*****************************************************************************/
boolean handleParamChange(int trianglePos)
{
  switch(trianglePos){
    case 0: // anchor bearing
      {
        int64_t encoderPos = encoder.getCount();
        if(encoderPos != 0){
          wData.anchorBearingDeg += -encoderPos * 5; // each step is 5 degrees
          if(wData.anchorBearingDeg < 0)
            wData.anchorBearingDeg += 360;
          wData.anchorBearingDeg = ((int)wData.anchorBearingDeg) % 360; // wrap around
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed
          wData.graphBufferClearingNeeded = true; //change that makes clearing of graph buffer necessary
          sprintf(outstring,"handleParamChange: Anchor bearing changed to %3.0f degrees", wData.anchorBearingDeg);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break;
    case 1: // anchor distance
      {
        int64_t encoderPos = encoder.getCount();
        if(encoderPos != 0){
          wData.anchorDistanceM += -encoderPos; // each step is 1 meter
          if(wData.anchorDistanceM < 5)
            wData.anchorDistanceM = 5; // minimum 5 meters
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          wData.graphBufferClearingNeeded = true; //change that makes clearing of graph buffer necessary
          sprintf(outstring,"handleParamChange: Anchor distance changed to %3.0f meters", wData.anchorDistanceM);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break;
    case 2: // alarm count
      {
        int64_t encoderPos = encoder.getCount();
        if(encoderPos != 0){
          wData.alarmThreshold += -encoderPos; // each step is 1
          if(wData.alarmThreshold < 1)
            wData.alarmThreshold = 1; // minimum 1
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: Alarm count changed to %ld", wData.alarmThreshold);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      } 
      break;
    case 3: // alarm distance
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          wData.alarmDistanceM += encoderPos; // each step is 1 meter
          if(wData.alarmDistanceM < 1)
            wData.alarmDistanceM = 1; // minimum 1 meter
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          wData.graphBufferClearingNeeded = true; //change that makes clearing of graph buffer necessary
          sprintf(outstring,"handleParamChange: Alarm distance changed to %3.0f meters", wData.alarmDistanceM);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      } 
      break;   
    case 4: // sleep time
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          wData.targetMeasurementIntervalSec += 5*encoderPos; // each step is 5 seconds
          if(wData.targetMeasurementIntervalSec < 1)
            wData.targetMeasurementIntervalSec = 1; // minimum 1 second
          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: targetMeasurementIntervalSec to %ld [s]", wData.targetMeasurementIntervalSec);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break; 
    case 5: // detail verbosity
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          // Drehwert-basierte Abfrage -  nich so gut für ENUM-Werte, springt meist einen zu weit
          //wData.verbosity = (enum verbosityType)(wData.verbosity + (verbosityType)encoderPos); // each step is 1
          //if(wData.verbosity > HI) 
          //  wData.verbosity = LO; // handle runover, valid are 0..2
          //if(wData.verbosity < LO) 
          //  wData.verbosity = HI; // handle runover, valid are 0..2  

          // einfach nur auf +/- dämpft das besser
          if(encoderPos > 0)
            wData.verbosity = (enum verbosityType)(wData.verbosity + 1); 
          else if(encoderPos < 0)
            wData.verbosity = (enum verbosityType)(wData.verbosity - 1); 
          if(wData.verbosity > HI) 
            wData.verbosity = LO; // handle runover, valid are 0..2
          if(wData.verbosity < LO) 
            wData.verbosity = HI; // handle runover, valid are 0..2        

          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: verbosity to %ld [s]", wData.verbosity);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break; 
    case 6: // graph weight  
      {
        int64_t encoderPos = -encoder.getCount();
        if(encoderPos != 0){
          // Drehwert-basierte Abfrage -  nich so gut für ENUM-Werte, springt meist einen zu weit
          //wData.graphWeight = (enum graphWeightType)(wData.graphWeight + (graphWeightType)encoderPos); // each step is 1 
          //if(wData.graphWeight > HEAVY) 
          //  wData.graphWeight = MINIM; // handle runover, valid are 0..2
          //if(wData.graphWeight < MINIM) 
          //  wData.graphWeight = HEAVY; // handle runover, valid are 0..2  

          // einfach nur auf +/- dämpft das besser
          if(encoderPos > 0)
            wData.graphWeight = (enum graphWeightType)(wData.graphWeight + 1); 
          else if(encoderPos < 0)
            wData.graphWeight = (enum graphWeightType)(wData.graphWeight - 1); 
          if(wData.graphWeight > HEAVY) 
            wData.graphWeight = MINIM; // handle runover, valid are 0..2
          if(wData.graphWeight < MINIM) 
            wData.graphWeight = HEAVY; // handle runover, valid are 0..2                


          wData.preferencesChanged = true; // flag to indicate that a preference value has been changed  
          sprintf(outstring,"handleParamChange: graphWeight to %ld [s]", wData.graphWeight);
          logOut(2, outstring);
          encoder.setCount(0); // reset encoder count
          drawInputData(); // redraw input data
        }  // encoder
      }
      break; 
    case 7: // exit parameter change mode
      {
        logOut(2, (char*)"handleParamChange: !!!!!!!!! EXIT !!!!!!!!!");
        return false;
      }
      break;   
    default:
      sprintf(outstring,"handleParamChange: default %d in case statement",trianglePos);
      logOut(2, outstring);
  } 
  return true;
}

